(아직 미정리) 

--- 


###  Loop engineering이란? 
* hook과 hook으로 연결지어서 에이전트가 명확하게 정해진 goal 을 달성하기 위해 지속적으로 작동하게끔 만드는 하네스 엔지니어링 


* oh-my-claudecode - 써보고 반드시 졸업해야 함 -- WHY? 범용 플러그인이기 때문에 자기 개인만의 플러그인을 구상해야 함 
* 클로드코드가 엔터프라이즈향으로 가기 위해서는 권한설정, 보안, SSO 등이 필요한데 그건 SI의 영역




< QnA >  
* 엔터프라이즈에서 운영하게 되면 langgraph 문제 추적? langfuse 사용 추천
* 엔터프라이즈에서는 
* hermes agent - 각종 툴간의 연동성이 좋음 (이미 연동되어있는 게 많음) - AI의 자동화에 포커스 
* 클로드/코덱스 - task의 정합성 
* 온톨로지 구축방법, 방안? 왜 내려갔을까? 구축하는 게 쉽지 않기도 하고 
-> 온톨로지가 해결하는 graph 기반의 문제가 있음 
-> 일반 rag 기반 구축으로 풀지 못하는 걸 풀 수 있는 문제가 있음 
-> entity와 설계가 굉장히 중요 / 하나하나 구축하는 비용이 꽤 큼
-> 온톨로지 어설프게 도입했다가 빼는 경우도 많다 (권한 툴 검증)

* 권한과 보안은 둘째치고 툴 검증에 대한 고민을 현업들에게도 많이 생겨나고 있음 
-> 도구 호출에 대한 정확도에 대해 검증 필요성이 늘어남 
-> 어떤 prompt를 작성해야 하는지, 도구호출을 적절하게 하도록 어떻게 설계해야 할 지 
-> 이러한 부분들이 앞으로 더욱 증가할 것이다 

* AI Native ? 
API 호출들이 도구로 나와줘야 한다 
AI Native 안에서 되려면... 
LLM이 쓸 수 있는 도구로 바꾸주는 건 되는데, 도구호출의 정확도는 떨어지는 부분은 어떻게 해결할 수 있을지
해당 부분을 검증하고 평가하는 방법론들이 많이 나오고 있음 (정답 데이터가 나오고 있음 - 1번문제에 대해서는 00도구호출이 되어야 하는 등의 정답지) 


* 아키텍처 관련 견문 넓히기 
스펙문서 개선 
소소한 팁 - 네가티브 테스틑 
(정답이 나오는 것과 틀린 답이 나오도록 시켜보기) 
네가티브 조항들을 추가하게 되는 것 
적어도 이걸 하면 안된다는 rules들을 쌓아 올려나가는 것
verification logic을 돌리기 

* loop engineering : 하네스 엔지니어링과 비슷한 개념인데, self-evolving을 하게끔 만드는 방법론 


* 대기업 - 온프레미스 구축 
* AI guardrail 
-> 입출력 데이터에 가드레일을 두는 것 : 정규표현식(마스킹), LLM을 사용 (비정형 데이터를 타겟), 딥러닝모델(최대한 딥러닝 모델로 처리해주도록) 
(+) Agent 구축할 때 ai guardrail 어디가 또 중요할까? 
-> tool 관련 부분 - tool 호출 결과가 다음 노드의 입력으로 들어가는 경우가 많기 때문에 
-> 아키텍트 관점으로 AI Guardrail을 해야 하는 부분을 고민해보는 게 중요
-> 보안상으로는 여러 곳곳에 치는 게 좋겠지만, 아키텍트 관점으로서 중요한 게 여러 곳곳에 두게되면 답변 지연에 영향을 줌 (보안과 속도 트레이드오프...) 
-> 바깥쪽으로 보안을 치는 경우가 많음 
-> 실질적으로 운영단계에서 너무 느려지게 됨 
-> 사람의 기술은 갈증에 대해서 혁신이 나옴 
-> 하네스 엔지니어링, 루프 엔지니어링 하는 이유? llm이 한번에 우리의 설계를 이해하는 데 토큰이 한계가 있기 때문에 
(우리의 업무를 한번에 처리할 수 있는 시대가 온다면 하네스 엔지니어링도 필요 없게 될 것임) 
-> 지식의 체계를 잘 거쳐서, 제한된 컨텍스트 사이즈에 맞춰 문제해결을 해야 하는 데, 이것의 대안으로 LLM wiki를 잘 구성하는 것 (마크다운 문서를 잘 구성하는 게 중요) 
(rag와 llm wiki를 잘 구성하는 것도 중요) 
-> skill, wiki, memory 등으로 이런 부분을 상당 부분 보완 가능 
-> 몇 십만건의 문서를 rag하는 것은 어려움, 클코는 몇 십만건의 코딩은 왜가능할 까? 
-> 클로드 코드 암묵지 
-> 하네스와 루프엔지니어링 코딩도하는데 이걸 못할까? 해서 계속 도전하고 있음 왜 rag에서 wiki로 넘어왔을까? 
우리의 암묵직도 코딩파일처럼 llm이 쉽게 찾을 수 있게 잘 정리해두면 되지 않을까 해서 나온 것 
-> 체계를 만드는 것 (업무 히스토리, 실무자의 암묵지 등 llm이 참조하기 좋은 형태로 있어야 한다는 것!)이 먼저! 
-> ai가 반복해서 참조할 수 있는 구조를 만드는 것이 중요 
-> 결론: 복잡한 하네스엔지니어링, 루프 엔지니어링은 llm이 잘 만들어줄 것임, 그러나 인간이 갖고 있는 암묵지를 llm이 잘 참조할 수 있도록 체계를 구축하는 게 중요 
-> doc cling, semantic chunking 관련 찾아보기(포지션을 집어서 의미를 찾아내는 것도 있음), llm을 써서 의미를 클러스터링 하는 방법들도 있음 
-> 엔터프라이즈(조직단위) 사업/ 개인단위 프로젝트 사업 : 다름!!! 
----> 조직단위의 사업 - 맞춤형 skill보다는 조직의 생산성을 많이 고려함 (ex) 이메일 관련 skill - 보안적 요소, 혐오발언 등을 검토하는 것을 주입) 
----> 개인단위 사업- 맞춤형 skill을 많이 사용 (ex) 이메일 관련 skill -개인의 문체, 개인의 취향 등의 정보를 주입하도록 함) 
-> skill 부터 개인/조직의 단위에 따라 달라지기 때문에 하네스/루프 엔지니어링 설계가 많이 달라짐 
-> 그래서 개인의 하네스를 구축하는 사람이 엔터프라이즈의 하네스를 구축을 잘한다는 보장이 없음 


평면화된 구성 -> 계층적 구성 

이거 다음의 이거 이거 다음의 이거 같은 phase 구성 가능 
스펙문서를 진화하는 형태로 설계 가능 
만들면서 스펙문서를 개정해나가기 때문 

스펙문서 진화 
결론 : 기능정의서 그대로 두고, 세부구현 액션플랜을 나누어서 스펙문서관련 세부구현 플랜을 입체적으로, 계층적으로 구성하는 게 중요 
로그인 기능, 결제기능, 영상기능 등 
-> 하위 스펙문서를 폴더링해서 기능 기반으로 나누는 것도 하나의 방법일 수 있음/ phase 별로도 정리 가능

스펙문서 다음을 genrate해서 다음의 스펙문서를 하자 
스펙문서를 개정해서 계속해서 개정이 가능 
10분마다 업데이트 
처음부터 동적은 어려움 

- 스펙문서를 개정하는 프로세스를 만들어서 업데이트 하게끔 처음부터 동적은 매우 어렵지만, 스펙문서를 기반으로 만드는 것은 충분히 가능 
- 에이전틱 rag, graph rag -  택일의 문제는 아님, 같이 쓸 수도 있도 따로 쓸수도 있고 task에 따라 택할 수 있는 문제 

* intent driven 
사람은 액션을 취하는데, 때로는 액션을 왜 취하는 지 모를 때가 있음 

* agent tool calling 

* 직접 해보고, 실패함이 많이 쌓여야 이런 경험들로 인해 인사이트가 더 생긴다. 시행착오를 겪어야 생긴다 

* 개인으로 쓰는 agent, 팀을 리드하는 agent 

* 10분마다 업데이트하는 루프 예시 ? 클로드에도 루프가 있고, 헤르메스 에이전트한테 10분마다 ~~강의자료 파일 업데이트 해달라고 요청  (업데이트 하는 방법론을 또 알려줘야 함)
-----> 자료조사를 하고 >  llm wiki에 쌓고 > 해당 레퍼런스 검증 > 강의자료 제작 하도록 방법론을 설계한 후 그걸 참조해서 업데이트 하도록 

* llm wiki github 구축 
--> md 파일 뿐만 아니라 여러 개의 파일형식으로 사용하는 것도 추천 

* 막간의 홍보 - 블로그 - wiki 생성
----> discord 링크 확인 
(가상의 폴더를 만들고 그걸 기반으로 서칭하는 구조 -- symboilic link 같은...) 
(사람마다 docs 문서 관련 가중치를 둬서 wiki 검색도 사람마다 다른 가중치로 검색되도록하는 프로세스...? )

* 경험을 공유하는 게 중요 
